In [1]:
import pandas as pd

In [5]:
path = 'DATA1.csv'

In [6]:
path

'DATA1.csv'

In [9]:
df=pd.read_csv(path, encoding = 'cp949')

In [11]:
df.head(3)

    구분 상세구분    미취학   초등학생    중학생   고등학생  대학교 및 대학원
0  시군별   시부  16.07  35.74  37.77  36.90      20.45
1  시군별   군부  12.53  25.85  35.89  27.02      13.74
2   성별   남자  15.68  35.26  39.11  35.85      21.31

In [16]:
null_count=df.isnull().sum()

In [18]:
null_count

구분           0
상세구분         0
미취학          1
초등학생         1
중학생          1
고등학생         2
대학교 및 대학원    4
dtype: int64

In [19]:
df_null_count = null_count.reset_index()

In [21]:
df_null_count

       index  0
0         구분  0
1       상세구분  0
2        미취학  1
3       초등학생  1
4        중학생  1
5       고등학생  2
6  대학교 및 대학원  4

In [22]:
df_null_count.columns=['메뉴','결측값']

In [24]:
df_null_count.columns=['메뉴','결측값']

In [26]:
df_null_count

          메뉴  결측값
0         구분    0
1       상세구분    0
2        미취학    1
3       초등학생    1
4        중학생    1
5       고등학생    2
6  대학교 및 대학원    4

In [34]:
df_null_count.tail(2)

          메뉴  결측값
5       고등학생    2
6  대학교 및 대학원    4

In [35]:
df_2=df_null_count.tail(2)
df_2

          메뉴  결측값
5       고등학생    2
6  대학교 및 대학원    4

In [36]:
drop_columns = df_2['메뉴']

In [38]:
drop_columns

5         고등학생
6    대학교 및 대학원
Name: 메뉴, dtype: object

In [40]:
df.shape

(17, 7)

In [158]:
df=df.drop(drop_columns,axis=1)

In [159]:
df.head(10)

    구분    상세구분    미취학   초등학생    중학생
0  시군별      시부  16.07  35.74  37.77
1  시군별      군부  12.53  25.85  35.89
2   성별      남자  15.68  35.26  39.11
3   성별      여자  13.66  28.82  28.34
4  연령별  15~19세    NaN    NaN    NaN
5  연령별  20~29세   9.98   6.08   0.00
6  연령별  30~39세  16.36  33.36  27.91
7  연령별  40~49세  15.76  36.99  40.82
8  연령별  50~59세  12.77  19.33  28.13
9  연령별  60세 이상   9.14  15.13  28.33